{"/deploying":{"title":"Deploying the chart","data":{"":"This guide will guide you through the process of deploying the operator.","prerequisites#Prerequisites":"A Kubernetes cluster with version >= 1.16\nHelm 3\nDocker or a container registry","deploying-the-chart-on-a-local-cluster-minikube-kind-or-k3d#Deploying the chart on a local cluster (minikube, kind or k3d)":"","1-build-the-operator-image#1. Build the operator image":"docker build -t <organization>/<name> .\n\nReplace <name> and <organization> with the name you provided when generating the project.","2-load-the-image-into-the-cluster#2. Load the image into the cluster":"","minikube#Minikube":"minikube image load <organization>/<name>","k3d#k3d":"k3d image import <organization>/<name>","kind#kind":"kind load docker-image <organization>/<name>","3-deploy-the-chart#3. Deploy the chart":"helm install <name> ./chart"}},"/":{"title":"Welcome to Kubernetes Scala Operator Scaffold","data":{"":"Welcome to the KSO project! This project provides a robust Kubernetes Operator Scaffold written in Scala designed to streamline the process of deploying and managing Custom Resource Definitions (CRD) on Kubernetes. It simplifies the creation of custom resources and leverages the power of Scala's advanced features to offer a type-safe, concurrent, and high-performing solution for Kubernetes resource management.","features#Features":"Use ZIO and the power of Scala to create a type-safe, concurrent, and high-performing Kubernetes Operator.\nUse the Kubernetes ZIO Client to interact with the Kubernetes API.\nUse the Kubernetes ZIO Operator to create and manage Custom Resource Definitions (CRD).\nAuto generate Scala source from CRD at build time.","license#License":"Distributed under the Apache 2.0 License. See LICENSE for more information.","authors#Authors":"This project was developed by the Polytech DO teams in June 2023.","about-the-project#About the Project":"For more information about the project, please visit our GitHub page."}},"/quickstart":{"title":"Quickstart","data":{"":"This guide will walk you through the steps to create a new project from the KSO template.","prerequisites#Prerequisites":"Make sure you have Scala installed on your machine.\nYou will need sbt (Scala Build Tool) installed on your machine.\nYou also need to have Kubernetes and kubectl installed and properly configured.","setting-up-the-project#Setting Up the Project":"","to-create-a-new-project-from-the-kso-template-use-the-following-sbt-command#To create a new project from the KSO template, use the following sbt command:":"sbt new do4-2022/scala-kube-operator-scaffold.g8\n\nThis command will prompt you for the properties needed to generate the project. For more information on the properties, see the Template Properties page.","navigate-to-the-project-directory#Navigate to the project directory:":"cd project-name\n\nReplace project-name with the name you provided when generating the project.","start-coding-and-have-fun#Start coding and have fun!":""}},"/template-properties":{"title":"Template properties","data":{"":"This is a list of all the properties that can be configured in the template:\nProperty\tDescription\tDefault\tname\tThe name of the operator\tmy-operator\torganization\tThe organization name\tcom.organization\texample_resource_group_organization\tThe organization name for the example resource\tcom.organization\texample_resource_group_extension\tThe extension name for the example resource\tcom\texample_resource_name_kind\tThe kind name for the example resource\tMyResource\texample_resource_name_singular\tThe singular name for the example resource\tmyresource\texample_resource_name_plural\tThe plural name for the example resource\tmyresources\nIf don't understand what these properties mean, you can open an issue and we will try to explain them better."}},"/understanding-template":{"title":"Understanding the template","data":{"":"The generated project has the following structure:\nsrc/main: This directory contains the operator scala files.\ncrd: This directory contains the CRD definition.\nyaml: This directory contains the CRD yaml files.\nproject: This directory contains the build properties and plugins.\n\nPlease explore the directories to understand the project structure in detail."}}}